{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "userDefinedMetadata": {"signature": {"inputs": {"generator_input:0": {"name": "generator_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"generator/G_MODEL/out_layer/Tanh:0": {"name": "generator/G_MODEL/out_layer/Tanh:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "generator/G_MODEL/E/LayerNorm_2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/E/LayerNorm_2/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "generator/G_MODEL/E/LayerNorm_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/E/LayerNorm_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/E/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/E/LayerNorm/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "generator/G_MODEL/D/LayerNorm_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/D/LayerNorm_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/D/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/D/LayerNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r4/2/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "generator/G_MODEL/C/r4/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r4/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r4/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r4/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r4/LayerNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/LayerNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/1/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "generator/G_MODEL/C/r2/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "generator/G_MODEL/C/r1/2/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "generator/G_MODEL/C/r1/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/G_MODEL/B/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "generator/G_MODEL/A/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/Conv_2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "generator/G_MODEL/A/MirrorPad_1/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/B/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/Conv_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/G_MODEL/C/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/Conv/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "generator/G_MODEL/C/r1/r1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/r1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/r2/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "generator/G_MODEL/C/r2/r2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/r3/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/r3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r3/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r4/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r4/r4/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r4/r4/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "generator/G_MODEL/C/r4/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/E/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/D/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/D/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/E/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/D/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/E/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/E/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/MirrorPad_2/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/E/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/MirrorPad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/E/Conv_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/out_layer/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "generator/G_MODEL/A/MirrorPad", "op": "MirrorPad", "input": ["generator_input", "generator/G_MODEL/A/MirrorPad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/Conv/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/A/MirrorPad", "generator/G_MODEL/A/Conv/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/A/LayerNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/A/Conv/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/A/LayerNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/A/Conv/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/A/LayerNorm/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/A/LayerNorm/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/Rsqrt", "generator/G_MODEL/A/LayerNorm/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/mul", "generator/G_MODEL/A/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/A/Conv/Conv2D", "generator/G_MODEL/A/LayerNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/A/LayerNorm/beta", "generator/G_MODEL/A/LayerNorm/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/mul_1", "generator/G_MODEL/A/LayerNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LeakyRelu", "op": "LeakyRelu", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add_1"], "attr": {"alpha": {"f": 0.20000000298023224}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/MirrorPad_1", "op": "MirrorPad", "input": ["generator/G_MODEL/A/LeakyRelu", "generator/G_MODEL/A/MirrorPad_1/paddings"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/A/Conv_1/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/A/MirrorPad_1", "generator/G_MODEL/A/Conv_1/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/A/Conv_1/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/A/Conv_1/Conv2D", "generator/G_MODEL/A/LayerNorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/A/LayerNorm_1/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/A/LayerNorm_1/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/A/LayerNorm_1/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/A/LayerNorm_1/batchnorm/Rsqrt", "generator/G_MODEL/A/LayerNorm_1/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/A/LayerNorm_1/batchnorm/mul", "generator/G_MODEL/A/LayerNorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/A/Conv_1/Conv2D", "generator/G_MODEL/A/LayerNorm_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/A/LayerNorm_1/beta", "generator/G_MODEL/A/LayerNorm_1/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_1/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm_1/batchnorm/mul_1", "generator/G_MODEL/A/LayerNorm_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LeakyRelu_1", "op": "LeakyRelu", "input": ["generator/G_MODEL/A/LayerNorm_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "generator/G_MODEL/A/MirrorPad_2", "op": "MirrorPad", "input": ["generator/G_MODEL/A/LeakyRelu_1", "generator/G_MODEL/A/MirrorPad_2/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/Conv_2/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/A/MirrorPad_2", "generator/G_MODEL/A/Conv_2/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/A/Conv_2/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/A/Conv_2/Conv2D", "generator/G_MODEL/A/LayerNorm_2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/A/LayerNorm_2/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/A/LayerNorm_2/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/A/LayerNorm_2/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/A/LayerNorm_2/batchnorm/Rsqrt", "generator/G_MODEL/A/LayerNorm_2/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/A/LayerNorm_2/batchnorm/mul", "generator/G_MODEL/A/LayerNorm_2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/A/Conv_2/Conv2D", "generator/G_MODEL/A/LayerNorm_2/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/A/LayerNorm_2/beta", "generator/G_MODEL/A/LayerNorm_2/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LayerNorm_2/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm_2/batchnorm/mul_1", "generator/G_MODEL/A/LayerNorm_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/A/LeakyRelu_2", "op": "LeakyRelu", "input": ["generator/G_MODEL/A/LayerNorm_2/batchnorm/add_1"], "attr": {"alpha": {"f": 0.20000000298023224}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/MirrorPad", "op": "MirrorPad", "input": ["generator/G_MODEL/A/LeakyRelu_2", "generator/G_MODEL/A/MirrorPad_1/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/Conv/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/B/MirrorPad", "generator/G_MODEL/B/Conv/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/B/LayerNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/B/Conv/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/B/Conv/Conv2D", "generator/G_MODEL/B/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/B/LayerNorm/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/B/LayerNorm/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/B/LayerNorm/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/B/LayerNorm/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/B/LayerNorm/batchnorm/Rsqrt", "generator/G_MODEL/B/LayerNorm/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/B/LayerNorm/batchnorm/mul", "generator/G_MODEL/B/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/B/Conv/Conv2D", "generator/G_MODEL/B/LayerNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/B/LayerNorm/beta", "generator/G_MODEL/B/LayerNorm/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/B/LayerNorm/batchnorm/mul_1", "generator/G_MODEL/B/LayerNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LeakyRelu", "op": "LeakyRelu", "input": ["generator/G_MODEL/B/LayerNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "generator/G_MODEL/B/MirrorPad_1", "op": "MirrorPad", "input": ["generator/G_MODEL/B/LeakyRelu", "generator/G_MODEL/A/MirrorPad_2/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "generator/G_MODEL/B/Conv_1/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/B/MirrorPad_1", "generator/G_MODEL/B/Conv_1/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/B/Conv_1/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/B/Conv_1/Conv2D", "generator/G_MODEL/B/LayerNorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/B/LayerNorm_1/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/B/LayerNorm_1/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/B/LayerNorm_1/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/B/LayerNorm_1/batchnorm/Rsqrt", "generator/G_MODEL/B/LayerNorm_1/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/B/LayerNorm_1/batchnorm/mul", "generator/G_MODEL/B/LayerNorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/B/Conv_1/Conv2D", "generator/G_MODEL/B/LayerNorm_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/B/LayerNorm_1/beta", "generator/G_MODEL/B/LayerNorm_1/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LayerNorm_1/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/B/LayerNorm_1/batchnorm/mul_1", "generator/G_MODEL/B/LayerNorm_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/B/LeakyRelu_1", "op": "LeakyRelu", "input": ["generator/G_MODEL/B/LayerNorm_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "generator/G_MODEL/C/MirrorPad", "op": "MirrorPad", "input": ["generator/G_MODEL/B/LeakyRelu_1", "generator/G_MODEL/A/MirrorPad_2/paddings"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/C/Conv/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/C/MirrorPad", "generator/G_MODEL/C/Conv/weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "generator/G_MODEL/C/LayerNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/C/Conv/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/C/LayerNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/C/Conv/Conv2D", "generator/G_MODEL/C/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/C/LayerNorm/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/C/LayerNorm/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/C/LayerNorm/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/C/LayerNorm/batchnorm/Rsqrt", "generator/G_MODEL/C/LayerNorm/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/C/LayerNorm/batchnorm/mul", "generator/G_MODEL/C/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/C/Conv/Conv2D", "generator/G_MODEL/C/LayerNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/C/LayerNorm/beta", "generator/G_MODEL/C/LayerNorm/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LayerNorm/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/C/LayerNorm/batchnorm/mul_1", "generator/G_MODEL/C/LayerNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/LeakyRelu", "op": "LeakyRelu", "input": ["generator/G_MODEL/C/LayerNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "generator/G_MODEL/C/r1/Conv/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/C/LeakyRelu", "generator/G_MODEL/C/r1/Conv/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/C/r1/Conv/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/C/r1/Conv/Conv2D", "generator/G_MODEL/C/r1/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/C/r1/LayerNorm/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/C/r1/LayerNorm/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/C/r1/LayerNorm/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/C/r1/LayerNorm/batchnorm/Rsqrt", "generator/G_MODEL/C/r1/LayerNorm/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/C/r1/LayerNorm/batchnorm/mul", "generator/G_MODEL/C/r1/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/C/r1/Conv/Conv2D", "generator/G_MODEL/C/r1/LayerNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/C/r1/LayerNorm/beta", "generator/G_MODEL/C/r1/LayerNorm/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LayerNorm/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/C/r1/LayerNorm/batchnorm/mul_1", "generator/G_MODEL/C/r1/LayerNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LeakyRelu", "op": "LeakyRelu", "input": ["generator/G_MODEL/C/r1/LayerNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "generator/G_MODEL/C/r1/MirrorPad", "op": "MirrorPad", "input": ["generator/G_MODEL/C/r1/LeakyRelu", "generator/G_MODEL/A/MirrorPad_2/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "generator/G_MODEL/C/r1/r1/r1", "op": "FusedDepthwiseConv2dNative", "input": ["generator/G_MODEL/C/r1/MirrorPad", "generator/G_MODEL/C/r1/r1/w", "generator/G_MODEL/C/r1/r1/bias"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "generator/G_MODEL/C/r1/1/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/C/r1/r1/r1", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/C/r1/1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/C/r1/1/moments/mean", "generator/G_MODEL/C/r1/r1/r1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/C/r1/1/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/C/r1/1/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/C/r1/1/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/C/r1/1/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/C/r1/1/batchnorm/Rsqrt", "generator/G_MODEL/C/r1/1/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/C/r1/1/batchnorm/mul", "generator/G_MODEL/C/r1/1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/C/r1/1/batchnorm/mul", "generator/G_MODEL/C/r1/r1/r1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/C/r1/1/beta", "generator/G_MODEL/C/r1/1/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/1/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/C/r1/1/batchnorm/mul_1", "generator/G_MODEL/C/r1/1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/LeakyRelu_1", "op": "LeakyRelu", "input": ["generator/G_MODEL/C/r1/1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "generator/G_MODEL/C/r1/Conv_1/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/C/r1/LeakyRelu_1", "generator/G_MODEL/C/r1/Conv_1/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/C/r1/2/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/C/r1/Conv_1/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/2/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/C/r1/2/moments/mean", "generator/G_MODEL/C/r1/Conv_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/2/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/C/r1/2/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/C/r1/2/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/C/r1/2/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/2/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/C/r1/2/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/2/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/C/r1/2/batchnorm/Rsqrt", "generator/G_MODEL/C/r1/2/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/2/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/C/r1/2/batchnorm/mul", "generator/G_MODEL/C/r1/2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/2/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/C/r1/2/batchnorm/mul", "generator/G_MODEL/C/r1/Conv_1/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/2/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/C/r1/2/beta", "generator/G_MODEL/C/r1/2/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r1/2/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/C/r1/2/batchnorm/mul_1", "generator/G_MODEL/C/r1/2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/Conv/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/C/r1/2/batchnorm/add_1", "generator/G_MODEL/C/r2/Conv/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/C/r2/Conv/Conv2D", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/C/r2/Conv/Conv2D", "generator/G_MODEL/C/r2/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/C/r2/LayerNorm/moments/SquaredDifference", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/batchnorm/add", "op": "AddV2", "input": ["generator/G_MODEL/A/LayerNorm/batchnorm/add/y", "generator/G_MODEL/C/r2/LayerNorm/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/C/r2/LayerNorm/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/batchnorm/mul", "op": "Mul", "input": ["generator/G_MODEL/C/r2/LayerNorm/batchnorm/Rsqrt", "generator/G_MODEL/C/r2/LayerNorm/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/batchnorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/C/r2/LayerNorm/batchnorm/mul", "generator/G_MODEL/C/r2/LayerNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/batchnorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/C/r2/Conv/Conv2D", "generator/G_MODEL/C/r2/LayerNorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/batchnorm/sub", "op": "Sub", "input": ["generator/G_MODEL/C/r2/LayerNorm/beta", "generator/G_MODEL/C/r2/LayerNorm/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LayerNorm/batchnorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/C/r2/LayerNorm/batchnorm/mul_1", "generator/G_MODEL/C/r2/LayerNorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/LeakyRelu", "op": "LeakyRelu", "input": ["generator/G_MODEL/C/r2/LayerNorm/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "generator/G_MODEL/C/r2/MirrorPad", "op": "MirrorPad", "input": ["generator/G_MODEL/C/r2/LeakyRelu", "generator/G_MODEL/A/MirrorPad_2/paddings"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/C/r2/r2/r2", "op": "FusedDepthwiseConv2dNative", "input": ["generator/G_MODEL/C/r2/MirrorPad", "generator/G_MODEL/C/r2/r2/w", "generator/G_MODEL/C/r2/r2/bias"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/1/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/C/r2/r2/r2", "generator/G_MODEL/A/LayerNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/C/r2/1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/C/r2/1/moments/mean", "generator/G_MODEL/C/r2/r2/r2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/C/r2/1/moments/variance", 