{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "userDefinedMetadata": {"signature": {"inputs": {"test:0": {"name": "test:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"generator/G_MODEL/Tanh:0": {"name": "generator/G_MODEL/Tanh:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "generator/G_MODEL/u1/InstanceNorm_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u1/InstanceNorm_1/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "generator/G_MODEL/u1/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u1/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u1/SeparableConv2d/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u1/SeparableConv2d/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/InstanceNorm/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/G_MODEL/u2/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/SeparableConv2d_1/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/SeparableConv2d_1/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/SeparableConv2d/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/SeparableConv2d/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/InstanceNorm_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/InstanceNorm_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r8/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r8/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r8/1/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "generator/G_MODEL/m/r8/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r8/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r8/InstanceNorm/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "generator/G_MODEL/m/r7/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r7/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r7/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r7/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r7/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r7/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r6/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r6/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r6/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r6/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r6/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r6/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r5/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r5/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r5/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r5/1/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "generator/G_MODEL/m/r5/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r5/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r4/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r4/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r4/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r4/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r4/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r4/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r2/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r2/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r2/1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r2/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r2/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r2/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r1/2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r1/2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r1/1/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "generator/G_MODEL/m/r1/1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r1/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r1/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_1/pointwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_2/InstanceNorm/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_2/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d/InstanceNorm/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/MirrorPad_2/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/pointwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/instancenorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/instancenorm/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "generator/G_MODEL/b1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/pointwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "generator/G_MODEL/b2/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d/pointwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u1/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_2/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_2/pointwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r1/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r1/r1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r2/Conv/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "generator/G_MODEL/m/r2/r2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r2/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/r3/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r3/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r4/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r4/r4/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "generator/G_MODEL/m/r4/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r5/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r5/r5/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r5/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r6/Conv/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "generator/G_MODEL/m/r6/r6/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r6/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r7/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r7/r7/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r7/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r8/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r8/r8/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/r8/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/m/Conv_1/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "generator/G_MODEL/u2/SeparableConv2d/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/SeparableConv2d/pointwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/SeparableConv2d_1/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/SeparableConv2d_1/pointwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u2/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "generator/G_MODEL/b1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "generator/G_MODEL/u1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "generator/G_MODEL/u1/SeparableConv2d/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/u1/SeparableConv2d/pointwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "generator/G_MODEL/u1/Conv/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}}}, {"name": "generator/G_MODEL/b1/MirrorPad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "generator/G_MODEL/u1/Conv_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/Conv/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "test", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/MirrorPad", "op": "MirrorPad", "input": ["test", "generator/G_MODEL/b1/MirrorPad/paddings"], "attr": {"mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/b1/Conv/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/b1/MirrorPad", "generator/G_MODEL/b1/Conv/weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/b1/Conv/Conv2D", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/b1/Conv/Conv2D", "generator/G_MODEL/b1/InstanceNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/b1/InstanceNorm/moments/SquaredDifference", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/instancenorm/add", "op": "AddV2", "input": ["generator/G_MODEL/b1/InstanceNorm/instancenorm/add/y", "generator/G_MODEL/b1/InstanceNorm/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/instancenorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/b1/InstanceNorm/instancenorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/instancenorm/mul", "op": "Mul", "input": ["generator/G_MODEL/b1/InstanceNorm/gamma", "generator/G_MODEL/b1/InstanceNorm/instancenorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/instancenorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/b1/InstanceNorm/instancenorm/mul", "generator/G_MODEL/b1/InstanceNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/instancenorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/b1/Conv/Conv2D", "generator/G_MODEL/b1/InstanceNorm/instancenorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/instancenorm/sub", "op": "Sub", "input": ["generator/G_MODEL/b1/InstanceNorm/beta", "generator/G_MODEL/b1/InstanceNorm/instancenorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm/instancenorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/b1/InstanceNorm/instancenorm/mul_1", "generator/G_MODEL/b1/InstanceNorm/instancenorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/LeakyRelu", "op": "LeakyRelu", "input": ["generator/G_MODEL/b1/InstanceNorm/instancenorm/add_1"], "attr": {"alpha": {"f": 0.20000000298023224}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/MirrorPad_1", "op": "MirrorPad", "input": ["generator/G_MODEL/b1/LeakyRelu", "generator/G_MODEL/b1/MirrorPad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "generator/G_MODEL/b1/Conv_1/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/b1/MirrorPad_1", "generator/G_MODEL/b1/Conv_1/weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/b1/Conv_1/Conv2D", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/b1/Conv_1/Conv2D", "generator/G_MODEL/b1/InstanceNorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/b1/InstanceNorm_1/moments/SquaredDifference", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/add", "op": "AddV2", "input": ["generator/G_MODEL/b1/InstanceNorm/instancenorm/add/y", "generator/G_MODEL/b1/InstanceNorm_1/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/b1/InstanceNorm_1/instancenorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/mul", "op": "Mul", "input": ["generator/G_MODEL/b1/InstanceNorm_1/gamma", "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/b1/InstanceNorm_1/instancenorm/mul", "generator/G_MODEL/b1/InstanceNorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/b1/Conv_1/Conv2D", "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/sub", "op": "Sub", "input": ["generator/G_MODEL/b1/InstanceNorm_1/beta", "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/b1/InstanceNorm_1/instancenorm/mul_1", "generator/G_MODEL/b1/InstanceNorm_1/instancenorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/LeakyRelu_1", "op": "LeakyRelu", "input": ["generator/G_MODEL/b1/InstanceNorm_1/instancenorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "generator/G_MODEL/b1/MirrorPad_2", "op": "MirrorPad", "input": ["generator/G_MODEL/b1/LeakyRelu_1", "generator/G_MODEL/b2/MirrorPad_2/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "generator/G_MODEL/b1/Shape", "op": "Shape", "input": ["generator/G_MODEL/b1/LeakyRelu_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["generator/G_MODEL/b1/MirrorPad_2", "generator/G_MODEL/b1/SeparableConv2d/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "generator/G_MODEL/b1/strided_slice", "op": "StridedSlice", "input": ["generator/G_MODEL/b1/Shape", "generator/G_MODEL/u1/strided_slice/stack", "generator/G_MODEL/u1/strided_slice/stack_1", "generator/G_MODEL/u1/strided_slice/stack"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "generator/G_MODEL/b1/strided_slice_1", "op": "StridedSlice", "input": ["generator/G_MODEL/b1/Shape", "generator/G_MODEL/u1/strided_slice/stack_1", "generator/G_MODEL/b1/strided_slice_1/stack_1", "generator/G_MODEL/u1/strided_slice/stack"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/separable_conv2d", "op": "Conv2D", "input": ["generator/G_MODEL/b1/SeparableConv2d/separable_conv2d/depthwise", "generator/G_MODEL/b1/SeparableConv2d/pointwise_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "generator/G_MODEL/b1/floordiv", "op": "FloorDiv", "input": ["generator/G_MODEL/b1/strided_slice", "generator/G_MODEL/u1/mul/x"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/b1/floordiv_1", "op": "FloorDiv", "input": ["generator/G_MODEL/b1/strided_slice_1", "generator/G_MODEL/u1/mul/x"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/b1/SeparableConv2d/separable_conv2d", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/b1/resize/size", "op": "Pack", "input": ["generator/G_MODEL/b1/floordiv", "generator/G_MODEL/b1/floordiv_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/moments/mean", "generator/G_MODEL/b1/SeparableConv2d/separable_conv2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["generator/G_MODEL/b1/LeakyRelu_1", "generator/G_MODEL/b1/resize/size"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": false}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/moments/SquaredDifference", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/b1/MirrorPad_3", "op": "MirrorPad", "input": ["generator/G_MODEL/b1/resize/ResizeBilinear", "generator/G_MODEL/b1/MirrorPad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/add", "op": "AddV2", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/moments/variance", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/instancenorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/separable_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["generator/G_MODEL/b1/MirrorPad_3", "generator/G_MODEL/b1/SeparableConv2d_1/depthwise_weights"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/separable_conv2d", "op": "Conv2D", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/separable_conv2d/depthwise", "generator/G_MODEL/b1/SeparableConv2d_1/pointwise_weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/mul", "op": "Mul", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/gamma", "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/separable_conv2d", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/mul", "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/mul", "generator/G_MODEL/b1/SeparableConv2d/separable_conv2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/moments/mean", "generator/G_MODEL/b1/SeparableConv2d_1/separable_conv2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/sub", "op": "Sub", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/beta", "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/moments/SquaredDifference", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/mul_1", "generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/add", "op": "AddV2", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/moments/variance", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/instancenorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d/LeakyRelu", "op": "LeakyRelu", "input": ["generator/G_MODEL/b1/SeparableConv2d/InstanceNorm/instancenorm/add_1"], "attr": {"alpha": {"f": 0.20000000298023224}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/mul", "op": "Mul", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/gamma", "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/mul", "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/mul_1", "op": "Mul", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/mul", "generator/G_MODEL/b1/SeparableConv2d_1/separable_conv2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/sub", "op": "Sub", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/beta", "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/add_1", "op": "AddV2", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/mul_1", "generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/SeparableConv2d_1/LeakyRelu", "op": "LeakyRelu", "input": ["generator/G_MODEL/b1/SeparableConv2d_1/InstanceNorm/instancenorm/add_1"], "attr": {"alpha": {"f": 0.20000000298023224}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b1/add", "op": "AddV2", "input": ["generator/G_MODEL/b1/SeparableConv2d/LeakyRelu", "generator/G_MODEL/b1/SeparableConv2d_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/MirrorPad", "op": "MirrorPad", "input": ["generator/G_MODEL/b1/add", "generator/G_MODEL/b1/MirrorPad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "mode": {"s": "UkVGTEVDVA=="}}}, {"name": "generator/G_MODEL/b2/Conv/Conv2D", "op": "Conv2D", "input": ["generator/G_MODEL/b2/MirrorPad", "generator/G_MODEL/b2/Conv/weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/moments/mean", "op": "Mean", "input": ["generator/G_MODEL/b2/Conv/Conv2D", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/moments/SquaredDifference", "op": "SquaredDifference", "input": ["generator/G_MODEL/b2/Conv/Conv2D", "generator/G_MODEL/b2/InstanceNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/moments/variance", "op": "Mean", "input": ["generator/G_MODEL/b2/InstanceNorm/moments/SquaredDifference", "generator/G_MODEL/b2/SeparableConv2d_1/InstanceNorm/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/instancenorm/add", "op": "AddV2", "input": ["generator/G_MODEL/b1/InstanceNorm/instancenorm/add/y", "generator/G_MODEL/b2/InstanceNorm/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/instancenorm/Rsqrt", "op": "Rsqrt", "input": ["generator/G_MODEL/b2/InstanceNorm/instancenorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/instancenorm/mul", "op": "Mul", "input": ["generator/G_MODEL/b2/InstanceNorm/gamma", "generator/G_MODEL/b2/InstanceNorm/instancenorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "generator/G_MODEL/b2/InstanceNorm/instancenorm/mul_2", "op": "Mul", "input": ["generator/G_MODEL/b2/InstanceNorm/instancenorm/mul", "generator/G_MODEL/b2/InstanceNorm/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": 